Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_1 (InputLayer)            [(None, 150, 4)]     0                                            
__________________________________________________________________________________________________
conv1d (Conv1D)                 (None, 150, 32)      160         input_1[0][0]                    
__________________________________________________________________________________________________
batch_normalization (BatchNorma (None, 150, 32)      128         conv1d[0][0]                     
__________________________________________________________________________________________________
activation (Activation)         (None, 150, 32)      0           batch_normalization[0][0]        
__________________________________________________________________________________________________
conv1d_2 (Conv1D)               (None, 150, 32)      5152        activation[0][0]                 
                                                                 activation_1[0][0]               
__________________________________________________________________________________________________
batch_normalization_1 (BatchNor (None, 150, 32)      128         conv1d_2[0][0]                   
__________________________________________________________________________________________________
activation_1 (Activation)       (None, 150, 32)      0           batch_normalization_1[0][0]      
__________________________________________________________________________________________________
batch_normalization_2 (BatchNor (None, 150, 32)      128         conv1d_2[1][0]                   
__________________________________________________________________________________________________
activation_2 (Activation)       (None, 150, 32)      0           batch_normalization_2[0][0]      
__________________________________________________________________________________________________
conv1d_3 (Conv1D)               (None, 150, 32)      5152        activation_2[0][0]               
                                                                 activation_3[0][0]               
__________________________________________________________________________________________________
batch_normalization_3 (BatchNor (None, 150, 32)      128         conv1d_3[0][0]                   
__________________________________________________________________________________________________
activation_3 (Activation)       (None, 150, 32)      0           batch_normalization_3[0][0]      
__________________________________________________________________________________________________
batch_normalization_4 (BatchNor (None, 150, 32)      128         conv1d_3[1][0]                   
__________________________________________________________________________________________________
activation_4 (Activation)       (None, 150, 32)      0           batch_normalization_4[0][0]      
__________________________________________________________________________________________________
conv1d_4 (Conv1D)               (None, 150, 32)      5152        activation_4[0][0]               
                                                                 activation_5[0][0]               
__________________________________________________________________________________________________
batch_normalization_5 (BatchNor (None, 150, 32)      128         conv1d_4[0][0]                   
__________________________________________________________________________________________________
activation_5 (Activation)       (None, 150, 32)      0           batch_normalization_5[0][0]      
__________________________________________________________________________________________________
batch_normalization_6 (BatchNor (None, 150, 32)      128         conv1d_4[1][0]                   
__________________________________________________________________________________________________
activation_6 (Activation)       (None, 150, 32)      0           batch_normalization_6[0][0]      
__________________________________________________________________________________________________
conv1d_6 (Conv1D)               (None, 150, 32)      5152        activation_6[0][0]               
                                                                 activation_7[0][0]               
__________________________________________________________________________________________________
batch_normalization_7 (BatchNor (None, 150, 32)      128         conv1d_6[0][0]                   
__________________________________________________________________________________________________
activation_7 (Activation)       (None, 150, 32)      0           batch_normalization_7[0][0]      
__________________________________________________________________________________________________
batch_normalization_8 (BatchNor (None, 150, 32)      128         conv1d_6[1][0]                   
__________________________________________________________________________________________________
activation_8 (Activation)       (None, 150, 32)      0           batch_normalization_8[0][0]      
__________________________________________________________________________________________________
conv1d_7 (Conv1D)               (None, 150, 32)      5152        activation_8[0][0]               
                                                                 activation_9[0][0]               
__________________________________________________________________________________________________
batch_normalization_9 (BatchNor (None, 150, 32)      128         conv1d_7[0][0]                   
__________________________________________________________________________________________________
activation_9 (Activation)       (None, 150, 32)      0           batch_normalization_9[0][0]      
__________________________________________________________________________________________________
batch_normalization_10 (BatchNo (None, 150, 32)      128         conv1d_7[1][0]                   
__________________________________________________________________________________________________
activation_10 (Activation)      (None, 150, 32)      0           batch_normalization_10[0][0]     
__________________________________________________________________________________________________
conv1d_8 (Conv1D)               (None, 150, 32)      5152        activation_10[0][0]              
                                                                 activation_11[0][0]              
__________________________________________________________________________________________________
batch_normalization_11 (BatchNo (None, 150, 32)      128         conv1d_8[0][0]                   
__________________________________________________________________________________________________
activation_11 (Activation)      (None, 150, 32)      0           batch_normalization_11[0][0]     
__________________________________________________________________________________________________
conv1d_5 (Conv1D)               (None, 150, 32)      1056        conv1d_4[1][0]                   
__________________________________________________________________________________________________
conv1d_1 (Conv1D)               (None, 150, 32)      1056        conv1d[0][0]                     
__________________________________________________________________________________________________
conv1d_9 (Conv1D)               (None, 150, 32)      1056        conv1d_8[1][0]                   
__________________________________________________________________________________________________
add (Add)                       (None, 150, 32)      0           conv1d_5[0][0]                   
                                                                 conv1d_1[0][0]                   
__________________________________________________________________________________________________
add_1 (Add)                     (None, 150, 32)      0           conv1d_9[0][0]                   
                                                                 add[0][0]                        
__________________________________________________________________________________________________
conv1d_10 (Conv1D)              (None, 150, 1)       33          add_1[0][0]                      
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 150, 32)      64          conv1d_10[0][0]                  
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 150, 1)       33          conv1d_11[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 150, 1)       2           conv1d_12[0][0]                  
__________________________________________________________________________________________________
cropping1d (Cropping1D)         (None, 100, 1)       0           dense_1[0][0]                    
__________________________________________________________________________________________________
max_pooling1d (MaxPooling1D)    (None, 100, 1)       0           cropping1d[0][0]                 
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 100, 1)       4           max_pooling1d[0][0]              
__________________________________________________________________________________________________
dropout (Dropout)               (None, 100, 1)       0           batch_normalization_12[0][0]     
==================================================================================================
Total params: 35,912
Trainable params: 101
Non-trainable params: 35,811
__________________________________________________________________________________________________