Model: "model_1"
__________________________________________________________________________________________________
Layer (type)                    Output Shape         Param #     Connected to                     
==================================================================================================
input_2 (InputLayer)            [(None, 150, 4)]     0                                            
__________________________________________________________________________________________________
conv1d_11 (Conv1D)              (None, 150, 32)      160         input_2[0][0]                    
__________________________________________________________________________________________________
batch_normalization_12 (BatchNo (None, 150, 32)      128         conv1d_11[0][0]                  
__________________________________________________________________________________________________
activation_12 (Activation)      (None, 150, 32)      0           batch_normalization_12[0][0]     
__________________________________________________________________________________________________
conv1d_13 (Conv1D)              (None, 150, 32)      6176        activation_12[0][0]              
                                                                 activation_13[0][0]              
__________________________________________________________________________________________________
batch_normalization_13 (BatchNo (None, 150, 32)      128         conv1d_13[0][0]                  
__________________________________________________________________________________________________
activation_13 (Activation)      (None, 150, 32)      0           batch_normalization_13[0][0]     
__________________________________________________________________________________________________
batch_normalization_14 (BatchNo (None, 150, 32)      128         conv1d_13[1][0]                  
__________________________________________________________________________________________________
activation_14 (Activation)      (None, 150, 32)      0           batch_normalization_14[0][0]     
__________________________________________________________________________________________________
conv1d_14 (Conv1D)              (None, 150, 32)      6176        activation_14[0][0]              
                                                                 activation_15[0][0]              
__________________________________________________________________________________________________
batch_normalization_15 (BatchNo (None, 150, 32)      128         conv1d_14[0][0]                  
__________________________________________________________________________________________________
activation_15 (Activation)      (None, 150, 32)      0           batch_normalization_15[0][0]     
__________________________________________________________________________________________________
batch_normalization_16 (BatchNo (None, 150, 32)      128         conv1d_14[1][0]                  
__________________________________________________________________________________________________
activation_16 (Activation)      (None, 150, 32)      0           batch_normalization_16[0][0]     
__________________________________________________________________________________________________
conv1d_15 (Conv1D)              (None, 150, 32)      6176        activation_16[0][0]              
                                                                 activation_17[0][0]              
__________________________________________________________________________________________________
batch_normalization_17 (BatchNo (None, 150, 32)      128         conv1d_15[0][0]                  
__________________________________________________________________________________________________
activation_17 (Activation)      (None, 150, 32)      0           batch_normalization_17[0][0]     
__________________________________________________________________________________________________
batch_normalization_18 (BatchNo (None, 150, 32)      128         conv1d_15[1][0]                  
__________________________________________________________________________________________________
activation_18 (Activation)      (None, 150, 32)      0           batch_normalization_18[0][0]     
__________________________________________________________________________________________________
conv1d_17 (Conv1D)              (None, 150, 32)      6176        activation_18[0][0]              
                                                                 activation_19[0][0]              
__________________________________________________________________________________________________
batch_normalization_19 (BatchNo (None, 150, 32)      128         conv1d_17[0][0]                  
__________________________________________________________________________________________________
activation_19 (Activation)      (None, 150, 32)      0           batch_normalization_19[0][0]     
__________________________________________________________________________________________________
batch_normalization_20 (BatchNo (None, 150, 32)      128         conv1d_17[1][0]                  
__________________________________________________________________________________________________
activation_20 (Activation)      (None, 150, 32)      0           batch_normalization_20[0][0]     
__________________________________________________________________________________________________
conv1d_18 (Conv1D)              (None, 150, 32)      6176        activation_20[0][0]              
                                                                 activation_21[0][0]              
__________________________________________________________________________________________________
batch_normalization_21 (BatchNo (None, 150, 32)      128         conv1d_18[0][0]                  
__________________________________________________________________________________________________
activation_21 (Activation)      (None, 150, 32)      0           batch_normalization_21[0][0]     
__________________________________________________________________________________________________
batch_normalization_22 (BatchNo (None, 150, 32)      128         conv1d_18[1][0]                  
__________________________________________________________________________________________________
activation_22 (Activation)      (None, 150, 32)      0           batch_normalization_22[0][0]     
__________________________________________________________________________________________________
conv1d_19 (Conv1D)              (None, 150, 32)      6176        activation_22[0][0]              
                                                                 activation_23[0][0]              
__________________________________________________________________________________________________
batch_normalization_23 (BatchNo (None, 150, 32)      128         conv1d_19[0][0]                  
__________________________________________________________________________________________________
activation_23 (Activation)      (None, 150, 32)      0           batch_normalization_23[0][0]     
__________________________________________________________________________________________________
conv1d_16 (Conv1D)              (None, 150, 32)      1056        conv1d_15[1][0]                  
__________________________________________________________________________________________________
conv1d_12 (Conv1D)              (None, 150, 32)      1056        conv1d_11[0][0]                  
__________________________________________________________________________________________________
conv1d_20 (Conv1D)              (None, 150, 32)      1056        conv1d_19[1][0]                  
__________________________________________________________________________________________________
add_2 (Add)                     (None, 150, 32)      0           conv1d_16[0][0]                  
                                                                 conv1d_12[0][0]                  
__________________________________________________________________________________________________
add_3 (Add)                     (None, 150, 32)      0           conv1d_20[0][0]                  
                                                                 add_2[0][0]                      
__________________________________________________________________________________________________
conv1d_21 (Conv1D)              (None, 150, 1)       33          add_3[0][0]                      
__________________________________________________________________________________________________
flatten_1 (Flatten)             (None, 150)          0           conv1d_21[0][0]                  
__________________________________________________________________________________________________
dense_1 (Dense)                 (None, 1)            151         flatten_1[0][0]                  
==================================================================================================
Total params: 42,104
Trainable params: 41,336
Non-trainable params: 768
